In [41]:
import pandas as pd
import numpy as np

In [34]:
censo=pd.read_stata("censo.dta")
county=pd.read_stata("countys.dta")

In [35]:
censo

        state      county  nestab90   cfips  firms90           _merge
0     Alabama     Autauga        31  1001.0     31.0      matched (3)
1     Alabama     Baldwin         7  1003.0      7.0      matched (3)
2     Alabama     Barbour        67  1005.0     67.0      matched (3)
3     Alabama        Bibb         8  1007.0      8.0      matched (3)
4     Alabama      Blount        35  1009.0     35.0      matched (3)
...       ...         ...       ...     ...      ...              ...
2797  Wyoming     Natrona         3     NaN      NaN  master only (1)
2798  Wyoming    Sheridan         7     NaN      NaN  master only (1)
2799  Wyoming  Sweetwater         2     NaN      NaN  master only (1)
2800  Wyoming       Uinta         9     NaN      NaN  master only (1)
2801  Wyoming      Weston         1     NaN      NaN  master only (1)

[2802 rows x 6 columns]

In [36]:
censo["A"]=censo.state+censo.county
censo["C"]=1
censo.iloc[:,6:8]

                      A  C
0        AlabamaAutauga  1
1        AlabamaBaldwin  1
2        AlabamaBarbour  1
3           AlabamaBibb  1
4         AlabamaBlount  1
...                 ... ..
2797     WyomingNatrona  1
2798    WyomingSheridan  1
2799  WyomingSweetwater  1
2800       WyomingUinta  1
2801      WyomingWeston  1

[2802 rows x 2 columns]

In [37]:
county["A"]=county.state+county.county
county

          county  cfips    state                  A
0        Autauga   1001  Alabama     AlabamaAutauga
1        Baldwin   1003  Alabama     AlabamaBaldwin
2        Barbour   1005  Alabama     AlabamaBarbour
3           Bibb   1007  Alabama        AlabamaBibb
4         Blount   1009  Alabama      AlabamaBlount
...          ...    ...      ...                ...
3228  Sweetwater  56037  Wyoming  WyomingSweetwater
3229       Teton  56039  Wyoming       WyomingTeton
3230       Uinta  56041  Wyoming       WyomingUinta
3231    Washakie  56043  Wyoming    WyomingWashakie
3232      Weston  56045  Wyoming      WyomingWeston

[3233 rows x 4 columns]

In [38]:
new=pd.merge(county, censo.iloc[:,6:8], how="left", on="A")

In [45]:
new.C=new.C.replace(np.nan, 0)

In [47]:
new.to_excel("old_new.xls")